name: "FK"
layer {
	name: "fk-data"
	type: "HDF5Data"
	top: "data"
	top: "label"
	include {
		phase: TRAIN
	}
	hdf5_data_param {
		source: "/home/yeler082/test/facial-keypoints-detection/train.txt"
		batch_size: 64
	}
}
layer {
	name: "fk-val"
	type: "HDF5Data"
	top: "data"
	top: "label"
	include {
		phase: TEST
	}
	hdf5_data_param {
		source: "/home/yeler082/test/facial-keypoints-detection/val.txt"
		batch_size: 100
	}
}
layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "data"
	top: "ip1"
	param {
		lr_mult: 1
	}
	param {
		lr_mult: 2
	}
	inner_product_param {
		num_output: 100
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
}
layer {
	name: "relu1"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	param {
		lr_mult: 1
	}
	param {
		lr_mult: 2
	}
	inner_product_param {
		num_output: 30
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
}
layer {
	name: "loss"
	type: "EuclideanLoss"
	bottom: "ip2"
	bottom: "label"
	top: "loss"
}